#include <stdio.h>												//подключение библиатеки ввода\выводы
void prnt(double *x)											//ф-€ вывода результата
{
	printf("result: %.2lf\n", *x);								//вывод результата
}
int main()														//точка входа
{
	while (1)													//безконечный цикл
	{
		system("cls");											//очистка консоли

		printf("*********************************\n");			//вывод заголовка
		printf("*                               *\n");			//вывод заголовка
		printf("* The first program. Functions. *\n");			//вывод заголовка
		printf("*                               *\n");			//вывод заголовка
		printf("*********************************\n");			//вывод заголовка

		double x;												//объ€вление переменой

		scanf_s("%lf", &x);										//ввод переменой

		prnt(&x);												//вызов ф-и вывода результата

		system("pause");										//пауза
	}
	return(0);													//завершение mian с кодом ноль
}