#include <stdio.h>												//подключение библиатеки ввода\выводы
#include <math.h>												//подключение библиатеки math дл€ sin()

double f(int a, int b)										    //объ€вление функции
{
	return(a * 2 + b / 5 +sin(a + b));                          //возврат значени€
}

int main()														//точка входа
{ 
	while (1)													//безконечный цикл
	{
		system("cls");											//очистка консоли
		printf("*********************************\n");			//вывод заголовка
		printf("*                               *\n");			//вывод заголовка
		printf("* The first program. Functions. *\n");			//вывод заголовка
		printf("*                               *\n");			//вывод заголовка
		printf("*********************************\n");			//вывод заголовка

		int x;                                                  //объ€вление переменой
		int y;													//объ€вление переменой

		scanf_s("%d", &x);                                      //ввод переменой
		scanf_s("%d", &y);										//ввод переменой

		printf("%f\n", f(x, 0) + 2 * f(y, 1) + 2 * f(x, y));    //вывод результата
		system("pause");										//пауза
	}

	return(0);													//завершение mian с кодом ноль
}